alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--/*****************************************************************************
 *
 * Copyright (C) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Infineon Technologies AG (Infineon) is supplying this software for use with
 * Infineon's microcontrollers.  This file can be freely distributed within 
 * development tools that are supporting such microcontrollers. 
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************-->
<!-- edited with XMLSpy v2015 sp2 (http://www.altova.com) by Infineon Technologies AG (Infineon Technologies AG) -->
<!--Version of used XSLT processor: 1 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.8-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.2-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.2" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD.xsd">
	<vendor>Infineon</vendor>
	<name>XMC1400</name>
	<version>1.1.0 (Reference Manual v1.1)</version>
	<description>SVD file</description>
	<!--Release Notes
V1.1.0
	- Formal update to match latest reference manual version number
	- No register changes occured
-->
	<!--Release History
V1.0.6
	- Added service request information to "interrupt" elements
V1.0.5
	- Switch to SVD scheme V1.2 to enable register clustering
	- Changed CAN_MO registers from instance to cluster scheme
	- Corrected CAN block size to 0x200
	- Corrected CAN_NODEx block sizes to 0x100
	- Corrected CCU4x block sizes to 0x100
	- Corrected CCU8x block sizes to 0x100
	- Corrected SCU_INTERRUPT block size to 0x30
	- Removed enumeration type from CLK_PS bit field of LEDTS GLOBCTL register
	- Removed "Reserved" enumeration values
V1.0.4 
	- Update the following registers in CAN to align with XMC4800 CAN :
	- updated description of LISTx.EMPTY
	- removed the "do not use, #1111" option in MOFCR.MMC
	- added the "reserved, #00" option in MOAR.PRI
V1.0.3 
	- Update the baseAddress of CCU41
V1.0.2 
	- Update CAN to remove the FD related SFR
V1.0.1 
	- Fixed typo error at bit location of P1_IOCR4.PC7. 
	- Fixed errors in the address for SRRAW1, SRMASK1, SRCLR1 and SRSET1
V1.0.0 
	- first working version (adapted from XMC1300 AB step SVD v1.2.2)
-->
	<!--Differences to Reference Manual

- Extended grouping not existing in RM for following units:
  SCU -> many sub-groups
  CAN -> CAN, CAN_NODE, CAN_MO
  VADC -> VADC, VADC_G
  CCU4 -> CCU4, CCU4_CC4
  CCU8 -> CCU8, CCU8_CC8
- CAN registers MOCTR/MOSTAT and LIST reset values removed and masked out
-->
	<!--Compliance
- CMSIS-SVD V1.2
- Tested with ARM CMSIS-SVD SVD Consistency Checker / Header File Generator V2.87g
-->
	<cpu>
		<name>CM0</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>false</mpuPresent>
		<fpuPresent>false</fpuPresent>
		<nvicPrioBits>2</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>PPB</name>
			<description>Cortex-M0 Private Peripheral Block</description>
			<baseAddress>0xE000E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SYST_CSR</name>
					<description>SysTick Control and Status Register</description>
					<addressOffset>0x0010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Counter Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Counter disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Counter enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TICKINT</name>
							<description>SysTick Exception Request</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Counting down to zero does not assert the SysTick exception request.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Counting down to zero to assert the SysTick exception request.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSOURCE</name>
							<description>Clock Source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>External clock.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Processor clock.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUNTFLAG</name>
							<description>Counter Flag</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_RVR</name>
					<description>SysTick Reload Value Register</description>
					<addressOffset>0x0014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CVR</name>
					<description>SysTick Current Value Register</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CURRENT</name>
							<description>SysTick Counter Current Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CALIB</name>
					<description>SysTick Calibration Value Register</description>
					<addressOffset>0x001C</addressOffset>
					<size>32</size>
					<resetValue>0x40000147</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TENMS</name>
							<description>10 Milliseconds</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SKEW</name>
							<description>Clock Skew</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NOREF</name>
							<description>Reference Clock</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER</name>
					<description>Interrupt Set-enable Register</description>
					<addressOffset>0x0100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt Node Set-enable</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: Interrupt node disabled. Write: No effect.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read: Interrupt node enabled. Write: Enable interrupt node</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER</name>
					<description>IInterrupt Clear-enable Register</description>
					<addressOffset>0x0180</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt Node Clear-enable</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: Interrupt node disabled. Write: No effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read: Interrupt node enabled. Write: Disable interrupt node.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR</name>
					<description>Interrupt Set-pending Register</description>
					<addressOffset>0x0200</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt Node Set-pending</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: Interrupt node is not pending. Write: No effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read: Interrupt node is pending. Write: Change interrupt state to pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICPR</name>
					<description>Interrupt Clear-pending Register</description>
					<addressOffset>0x0280</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRPEND</name>
							<description>Interrupt Node Clear-pending</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: Interrupt node is not pending. Write: No effect.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read: Interrupt node is pending. Write: Remove interrupt state from pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR0</name>
					<description>Interrupt Priority Register 0</description>
					<addressOffset>0x0400</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR1</name>
					<description>Interrupt Priority Register 1</description>
					<addressOffset>0x0404</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR2</name>
					<description>Interrupt Priority Register 2</description>
					<addressOffset>0x0408</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR3</name>
					<description>Interrupt Priority Register 3</description>
					<addressOffset>0x040C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR4</name>
					<description>Interrupt Priority Register 4</description>
					<addressOffset>0x0410</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR5</name>
					<description>Interrupt Priority Register 5</description>
					<addressOffset>0x0414</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR6</name>
					<description>Interrupt Priority Register 6</description>
					<addressOffset>0x0418</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR7</name>
					<description>Interrupt Priority Register 7</description>
					<addressOffset>0x041C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPUID</name>
					<description>CPUID Base Register</description>
					<addressOffset>0x0D00</addressOffset>
					<size>32</size>
					<resetValue>0x410CC200</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Revision</name>
							<description>Revision Number</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Patch 0</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PartNo</name>
							<description>Part Number of the Processor</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Cortex-M0</description>
									<value>0xC20</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Architecture</name>
							<description>Architecture</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ARMv6-M</description>
									<value>0xC</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Variant</name>
							<description>Variant Number</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Revision 0</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Implementer</name>
							<description>Implementer Code</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ARM</description>
									<value>0x41</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
