alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
				<register>
					<name>PRIVDIS1</name>
					<description>Peripheral Privilege Access Register 1</description>
					<addressOffset>0x0084</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PDIS0</name>
							<description>USIC0 Channel 0 Privilege Disable Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>USIC0 Channel 0 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>USIC0 Channel 0 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS1</name>
							<description>USIC0 Channel 1 Privilege Disable Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>USIC0 Channel 1 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>USIC0 Channel 1 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS5</name>
							<description>VADC0 Basic SFRs Privilege Disable Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VADC0 Basic SFRs are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VADC0 Basic SFRs are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS6</name>
							<description>VADC0 Group 0 SFRs Privilege Disable Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VADC0 Group 0 SFRs are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VADC0 Group 0 SFRs are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS7</name>
							<description>VADC0 Group 1 SFRs Privilege Disable Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VADC0 Group 1 SFRs are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VADC0 Group 1 SFRs are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS8</name>
							<description>SHS0 Privilege Disable Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SHS0 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>SHS0 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS9</name>
							<description>CC40 and CCU40 Kernel SFRs Privilege Disable Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CC40 and CCU40 Kernel SFRs are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CC40 and CCU40 Kernel SFRs are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS10</name>
							<description>CCU40 CC41 Privilege Disable Flag</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU40 CC41 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU40 CC41 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS11</name>
							<description>CCU40 CC42 Privilege Disable Flag</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU40 CC42 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU40 CC42 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS12</name>
							<description>CCU40 CC43 Privilege Disable Flag</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU40 CC43 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU40 CC43 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS16</name>
							<description>USIC1 Channel 0 Privilege Disable Flag</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>USIC1 Channel 0 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>USIC1 Channel 0 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS17</name>
							<description>USIC1 Channel 1 Privilege Disable Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>USIC1 Channel 1 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>USIC1 Channel 1 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS25</name>
							<description>CCU41 Kernel SFRs and CC40 Privilege Disable Flag</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU41 Kernel SFRs and CC40 are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU41 Kernel SFRs and CC40 are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS26</name>
							<description>CCU41 CC41 Privilege Disable Flag</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU41 CC41 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU41 CC41 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS27</name>
							<description>CCU41 CC42 Privilege Disable Flag</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU41 CC42 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU41 CC42 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS28</name>
							<description>CCU41 CC43 Privilege Disable Flag</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU41 CC43 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU41 CC43 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIVDIS2</name>
					<description>Peripheral Privilege Access Register 2</description>
					<addressOffset>0x0088</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PDIS0</name>
							<description>CC80 and CCU80 Kernel SFRs Privilege Disable Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CC80 and CCU80 Kernel SFRs are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CC80 and CCU80 Kernel SFRs are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS1</name>
							<description>CCU80 CC81 Privilege Disable Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU80 CC81 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU80 CC81 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS2</name>
							<description>CCU80 CC82 Privilege Disable Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU80 CC82 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU80 CC82 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS3</name>
							<description>CCU80 CC83 Privilege Disable Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU80 CC83 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU80 CC83 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS12</name>
							<description>POSIF0 Privilege Disable Flag</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>POSIF0 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>POSIF0 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS13</name>
							<description>LEDTS0 Privilege Disable Flag</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LEDTS0 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>LEDTS0 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS14</name>
							<description>LEDTS1 Privilege Disable Flag</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LEDTS1 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>LEDTS1 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS15</name>
							<description>BCCU0 Privilege Disable Flag</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>BCCU0 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>BCCU0 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS16</name>
							<description>CCU81 Kernel SFRs and CC80 Privilege Disable Flag</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU81 Kernel SFRs and CC80 are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU81 Kernel SFRs and CC80 are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS17</name>
							<description>CCU81 CC81 Privilege Disable Flag</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU81 CC81 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU81 CC81 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS18</name>
							<description>CCU81 CC82 Privilege Disable Flag</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU81 CC82 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU81 CC82 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS19</name>
							<description>CCU81 CC83 Privilege Disable Flag</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU81 CC83 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>CCU81 CC83 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS20</name>
							<description>MultiCAN Node 0 and Global SFRs Privilege Disable Flag</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MultiCAN node 0 and global SFRs are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MultiCAN node 0 and global SFRs are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS21</name>
							<description>MultiCAN Node 1 Privilege Disable Flag</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MultiCAN node 1 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MultiCAN node 1 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS23</name>
							<description>MultiCAN Message Object SFRs Privilege Disable Flag</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MultiCAN message object SFRs are accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MultiCAN message object SFRs are not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS28</name>
							<description>POSIF1 Privilege Disable Flag</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>POSIF1 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>POSIF1 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS29</name>
							<description>LEDTS2 Privilege Disable Flag</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LEDTS2 is accessible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>LEDTS2 is not accessible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ROMSIZE</name>
					<description>ROM Size Register</description>
					<addressOffset>0x0400</addressOffset>
					<size>32</size>
					<resetValue>0x00000B00</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>ROM Size</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FLSIZE</name>
					<description>Flash Size Register</description>
					<addressOffset>0x0404</addressOffset>
					<size>32</size>
					<resetValue>0x00033000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Flash Size</description>
							<lsb>12</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM0SIZE</name>
					<description>RAM0 Size Register</description>
					<addressOffset>0x0410</addressOffset>
					<size>32</size>
					<resetValue>0x00001000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>RAM0 Size</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
