alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>NVM</name>
			<description>NVM Unit</description>
			<baseAddress>0x40050000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>NVMSTATUS</name>
					<description>NVM Status Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>16</size>
					<resetValue>0x0002</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>WRPERR</name>
							<description>Write Protocol Error</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No write protocol failure occurred.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>At least one write protocol failure was detected.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ECC2READ</name>
							<description>ECC2 Read</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No ECC two bit failure during memory read operations.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>At least one ECC two bit failure was detected.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ECC1READ</name>
							<description>ECC1 Read</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No ECC single bit failure occurred.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>At least one ECC single bit failure was detected and corrected.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VERR</name>
							<description>Verify Error</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No fail bit.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>One fail bit in one data block.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Two fail bits in two different data blocks.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Two or more fail bits in one data block, or three or more fail bits overall.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SLEEP</name>
							<description>Sleep Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>NVM not in sleep mode, and no sleep or wake up procedure in progress.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>NVM in sleep mode, or busy due to a sleep or wake up procedure.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSY</name>
							<description>Busy</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The NVM is not busy. Memory reads from the cell array and register write accesses are possible.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The NVM is busy. Memory reads and register write accesses are not possible.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVMPROG</name>
					<description>NVM Programming Control Register</description>
					<addressOffset>0x0004</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>RSTECC</name>
							<description>Reset ECC</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Reset of .ECCxREAD and NVMSTATUS.WRPERR.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RSTVERR</name>
							<description>Reset Verify Error</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Reset of .VERR.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACTION</name>
							<description>ACTION: [VERIFY, ONE_SHOT, OPTYPE]</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Idle state, no action triggered. Writing 0x00 exits current mode.</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Start one-shot write operation with automatic verify.</description>
									<value>0x51</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Start one-shot write operation without verify.</description>
									<value>0x91</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Start continuous write operation with automatic verify of every write.</description>
									<value>0x61</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Start continuous write operation without verify.</description>
									<value>0xA1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Start one-shot page erase operation.</description>
									<value>0x92</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Start one-shot sector erase operation.</description>
									<value>0x94</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Start continuous sector erase operation.</description>
									<value>0xA4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Start continuous page erase operation.</description>
									<value>0xA2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Start one-shot verify-only: Written data is compared to array content.</description>
									<value>0xD0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Start continuous verify-only: Written data is compared to array content.</description>
									<value>0xE0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVMCONF</name>
					<description>NVM Configuration Register</description>
					<addressOffset>0x0008</addressOffset>
					<size>16</size>
					<resetValue>0x9000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>NVM_ON</name>
							<description>NVM On</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>NVM is switched to or stays in sleep mode.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>NVM is switched to or stays in normal mode.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT_ON</name>
							<description>Interrupt On</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No NVM ready interrupts are generated.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>NVM ready interrupts are generated.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SECPROT</name>
							<description>Sector Protection</description>
							<lsb>4</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>HRLEV</name>
							<description>Hardread Level</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal read</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Hardread written</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Hardread erased</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
