alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="LEDTS0">
			<name>LEDTS1</name>
			<description>LED and Touch Sense Unit 1</description>
			<groupName>LEDTS</groupName>
			<baseAddress>0x50020400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2C</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>IRQ30</name>
				<description>LED and Touch Sense Control Unit (Module 1)</description>
				<value>30</value>
			</interrupt>
		</peripheral>
		<peripheral derivedFrom="LEDTS0">
			<name>LEDTS2</name>
			<description>LED and Touch Sense Unit 2</description>
			<groupName>LEDTS</groupName>
			<baseAddress>0x50020800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2C</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>IRQ8</name>
				<description>LED and Touch Sense Control Unit (Module 2)</description>
				<value>8</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>USIC0</name>
			<description>Universal Serial Interface Controller 0</description>
			<groupName>USIC</groupName>
			<headerStructName>USIC</headerStructName>
			<baseAddress>0x48000008</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>4</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>IRQ9</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>9</value>
			</interrupt>
			<interrupt>
				<name>IRQ10</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>10</value>
			</interrupt>
			<interrupt>
				<name>IRQ11</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>11</value>
			</interrupt>
			<interrupt>
				<name>IRQ12</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>IRQ13</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>13</value>
			</interrupt>
			<interrupt>
				<name>IRQ14</name>
				<description>Universal Serial Interface Channel (Module 0)</description>
				<value>14</value>
			</interrupt>
			<registers>
				<register>
					<name>ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0</addressOffset>
					<size>32</size>
					<resetValue>0x00AAC000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral derivedFrom="USIC0">
			<name>USIC1</name>
			<description>Universal Serial Interface Controller 1</description>
			<groupName>USIC</groupName>
			<baseAddress>0x48004008</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>4</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>USIC0_CH0</name>
			<description>Universal Serial Interface Controller 0</description>
			<groupName>USIC</groupName>
			<headerStructName>USIC_CH</headerStructName>
			<baseAddress>0x48000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0200</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CCFG</name>
					<description>Channel Configuration Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<resetValue>0x000080CF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSC</name>
							<description>SSC Protocol Available</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The SSC protocol is not available.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The SSC protocol is available.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ASC</name>
							<description>ASC Protocol Available</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The ASC protocol is not available.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The ASC protocol is available.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIC</name>
							<description>IIC Protocol Available</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The IIC protocol is not available.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The IIC protocol is available.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IIS</name>
							<description>IIS Protocol Available</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The IIS protocol is not available.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The IIS protocol is available.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RB</name>
							<description>Receive FIFO Buffer Available</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A receive FIFO buffer is not available.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A receive FIFO buffer is available.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TB</name>
							<description>Transmit FIFO Buffer Available</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>A transmit FIFO buffer is not available.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A transmit FIFO buffer is available.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>KSCFG</name>
					<description>Kernel State Configuration Register</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MODEN</name>
							<description>Module Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The module is switched off immediately (without respecting a stop condition). It does not react on mode control actions and the module clock is switched off. The module does not react on read accesses and ignores write accesses (except to KSCFG).</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The module is switched on and can operate. After writing 1 to MODEN, it is recommended to read register KSCFG to avoid pipeline effects in the control block before accessing other Service Request Processing registers.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BPMODEN</name>
							<description>Bit Protection for MODEN</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MODEN is not changed.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MODEN is updated with the written value.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NOMCFG</name>
							<description>Normal Operation Mode Configuration</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Run mode 0 is selected.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Run mode 1 is selected.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Stop mode 0 is selected.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Stop mode 1 is selected.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BPNOM</name>
							<description>Bit Protection for NOMCFG</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>NOMCFG is not changed.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>NOMCFG is updated with the written value.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUMCFG</name>
							<description>Suspend Mode Configuration</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BPSUM</name>
							<description>Bit Protection for SUMCFG</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SUMCFG is not changed.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>SUMCFG is updated with the written value.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FDR</name>
					<description>Fractional Divider Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STEP</name>
							<description>Step Value</description>
							<lsb>0</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DM</name>
							<description>Divider Mode</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The divider is switched off, fFD = 0.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Normal divider mode selected.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Fractional divider mode selected.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The divider is switched off, fFD = 0.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESULT</name>
							<description>Result Value</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BRG</name>
					<description>Baud Rate Generator Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKSEL</name>
							<description>Clock Selection</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The fractional divider frequency fFD is selected.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The trigger signal DX1T defines fPIN. Signal MCLK toggles with fPIN.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal MCLK corresponds to the DX1S signal and the frequency fPIN is derived from the rising edges of DX1S.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TMEN</name>
							<description>Timing Measurement Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timing measurement is disabled: The trigger signals DX0T and DX1T are ignored.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timing measurement is enabled: The 10-bit counter is incremented by 1 with fPPP and stops counting when reaching its maximum value. If one of the trigger signals DX0T or DX1T become active, the counter value is captured into bit field CTV, the counter is cleared and a transmit shift event is generated.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PPPEN</name>
							<description>Enable 2:1 Divider for fPPP</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The 2:1 divider for fPPP is disabled. fPPP = fPIN</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The 2:1 divider for fPPP is enabled. fPPP = fMCLK = fPIN / 2.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTQSEL</name>
							<description>Input Selection for CTQ</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fCTQIN = fPDIV</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fCTQIN = fPPP</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fCTQIN = fSCLK</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fCTQIN = fMCLK</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCTQ</name>
							<description>Pre-Divider for Time Quanta Counter</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCTQ</name>
							<description>Denominator for Time Quanta Counter</description>
							<lsb>10</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIV</name>
							<description>Divider Mode: Divider Factor to Generate fPDIV</description>
							<lsb>16</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SCLKOSEL</name>
							<description>Shift Clock Output Select</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SCLK from the baud rate generator is selected as the SCLKOUT input source.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The transmit shift clock from DX1 input stage is selected as the SCLKOUT input source.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MCLKCFG</name>
							<description>Master Clock Configuration</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The passive level is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The passive level is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCLKCFG</name>
							<description>Shift Clock Output Configuration</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The passive level is 0 and the delay is disabled.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The passive level is 1 and the delay is disabled.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The passive level is 0 and the delay is enabled.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The passive level is 1 and the delay is enabled.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>INPR</name>
					<description>Interrupt Node Pointer Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TSINP</name>
							<description>Transmit Shift Interrupt Node Pointer</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output SR0 becomes activated.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output SR1 becomes activated.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Output SR2 becomes activated.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Output SR3 becomes activated.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Output SR4 becomes activated.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Output SR5 becomes activated.</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TBINP</name>
							<description>Transmit Buffer Interrupt Node Pointer</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>RINP</name>
							<description>Receive Interrupt Node Pointer</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AINP</name>
							<description>Alternative Receive Interrupt Node Pointer</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PINP</name>
							<description>Transmit Shift Interrupt Node Pointer</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Output SR0 becomes activated.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Output SR1 becomes activated.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Output SR2 becomes activated.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Output SR3 becomes activated.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Output SR4 becomes activated.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Output SR5 becomes activated.</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
