alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
				<register>
					<name>SRSET</name>
					<description>SCU Service Request Set</description>
					<addressOffset>0x000C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRWARN</name>
							<description>WDT pre-warning Interrupt Set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PI</name>
							<description>RTC Periodic Interrupt Set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>AI</name>
							<description>RTC Alarm Interrupt Set</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VDDPI</name>
							<description>VDDP pre-warning Interrupt Set</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ACMP0I</name>
							<description>Analog Comparator 0 Interrupt Set</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ACMP1I</name>
							<description>Analog Comparator 1 Interrupt Set</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ACMP2I</name>
							<description>Analog Comparator 2 Interrupt Set</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VDROPI</name>
							<description>VDROP Interrupt Set</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ORC0I</name>
							<description>Out of Range Comparator X Interrupt Set</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ORC1I</name>
							<description>Out of Range Comparator X Interrupt Set</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ORC2I</name>
							<description>Out of Range Comparator X Interrupt Set</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ORC3I</name>
							<description>Out of Range Comparator X Interrupt Set</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ORC4I</name>
							<description>Out of Range Comparator X Interrupt Set</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ORC5I</name>
							<description>Out of Range Comparator X Interrupt Set</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ORC6I</name>
							<description>Out of Range Comparator X Interrupt Set</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>ORC7I</name>
							<description>Out of Range Comparator X Interrupt Set</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LOCI</name>
							<description>Loss of DCO1 Clock Interrupt Set</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PESRAMI</name>
							<description>16kbytes SRAM Parity Error Interrupt Set</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PEU0I</name>
							<description>USIC0 SRAM Parity Error Interrupt Set</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FLECC2I</name>
							<description>Flash Double Bit ECC Interrupt Set</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>FLCMPLTI</name>
							<description>Flash Operation Complete Interrupt Set</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>VCLIPI</name>
							<description>VCLIP Interrupt Set</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SBYCLKFI</name>
							<description>Standby Clock Failure Interrupt Set</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_CTR</name>
							<description>RTC CTR Mirror Register Update Set</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_ATIM0</name>
							<description>RTC ATIM0 Mirror Register Update Set</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_ATIM1</name>
							<description>RTC ATIM1 Mirror Register Update Set</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_TIM0</name>
							<description>RTC TIM0 Mirror Register Update Set</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>RTC_TIM1</name>
							<description>RTC TIM1 Mirror Register Update Set</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_DONE</name>
							<description>DTS Measurement Done Interrupt Set</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_HIGH</name>
							<description>DTS Compare High Temperature Interrupt Set</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>TSE_LOW</name>
							<description>DTS Compare Low Temperature Interrupt Set</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SRRAW1</name>
					<description>SCU Raw Service Request Status 1</description>
					<addressOffset>0x0020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ACMP3I</name>
							<description>Analog Comparator 3 Event Status Before Masking</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>LOECI</name>
							<description>Loss of External OSC_HP Clock Event Status Before Masking</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PEU1I</name>
							<description>USIC1 SRAM Parity Error Event Status Before Masking</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>PEMCI</name>
							<description>MultiCAN SRAM Parity Error Event Status Before Masking</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>DCO1OFSI</name>
							<description>DCO1 Out of SYNC Event Status Before Masking</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SRMSK1</name>
					<description>SCU Service Request Mask 1</description>
					<addressOffset>0x0024</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ACMP3I</name>
							<description>Analog Comparator 3 Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>LOECI</name>
							<description>Loss of External OSC_HP Clock Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PEU1I</name>
							<description>USIC1 SRAM Parity Error Interrupt Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PEMCI</name>
							<description>MultiCAN SRAM Parity Error Interrupt Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DCO1OFSI</name>
							<description>DCO1 Out of SYNC Interrupt Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SRCLR1</name>
					<description>SCU Service Request Clear 1</description>
					<addressOffset>0x0028</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ACMP3I</name>
							<description>Analog Comparator 3 Interrupt Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LOECI</name>
							<description>Loss of External OSC_HP Clock Interrupt Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PEU1I</name>
							<description>USIC1 SRAM Parity Error Interrupt Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PEMCI</name>
							<description>MultiCAN SRAM Parity Error Interrupt Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DCO1OFSI</name>
							<description>DCO1 Out of SYNC Interrupt Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SRSET1</name>
					<description>SCU Service Request Set 1</description>
					<addressOffset>0x002C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ACMP3I</name>
							<description>Analog Comparator 3 Interrupt Set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>LOECI</name>
							<description>Loss of External OSC_HP Clock Interrupt Set</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PEU1I</name>
							<description>USIC1 SRAM Parity Error Interrupt Set</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PEMCI</name>
							<description>MultiCAN SRAM Parity Error Interrupt Set</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DCO1OFSI</name>
							<description>DCO1 Out of SYNC Interrupt Set</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
