alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
				<register>
					<name>ANACMP3</name>
					<description>Analog Comparator 3 Control Register</description>
					<addressOffset>0xB68</addressOffset>
					<size>16</size>
					<resetValue>0x0020</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CMP_EN</name>
							<description>Comparator enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Comparator is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Comparator is enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP_FLT_OFF</name>
							<description>Disables comparator filter</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>filter is active</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>filter is switched off (to prevent a filter delay)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP_INV_OUT</name>
							<description>Inverted Comparator output</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no inversion of comparator signal</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>comparator signal is inverted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP_HYST_ADJ</name>
							<description>Comparator hysteresis adjust</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Comparator hysteresis is switched off</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Hysteresis_typ = 10mV</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Hysteresis_typ = 15mV</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Hysteresis_typ = 20mV</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ACMP3_SEL</name>
							<description>Connect ACMP3.INP to ACMP1.INP</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ACMP3.INP is not connected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>ACMP3.INP is connected to ACMP1.INP</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP_OUT</name>
							<description>Comparator output monitor bit</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>state "Vminus &gt; Vplus"</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>state "Vminus &lt; Vplus"</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU_ANALOG</name>
			<description>System Control Unit</description>
			<groupName>SCU</groupName>
			<baseAddress>0x40011000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ANATSECTRL</name>
					<description>Temperature Sensor Control Register</description>
					<addressOffset>0x24</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>TSE_EN</name>
							<description>Temperature sensor enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Temperature sensor is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Temperature sensor is switched on</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ANATSEIH</name>
					<description>Temperature Sensor High Temperature Interrupt Register</description>
					<addressOffset>0x30</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>TSE_IH</name>
							<description>Counter value for high temperature interrupt</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ANATSEIL</name>
					<description>Temperature Sensor Low Temperature Interrupt Register</description>
					<addressOffset>0x34</addressOffset>
					<size>16</size>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>TSE_IL</name>
							<description>Counter value for low temperature interrupt</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ANATSEMON</name>
					<description>Temperature Sensor Counter2 Monitor Register</description>
					<addressOffset>0x40</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>TSE_MON</name>
							<description>Result values; loaded by TSE_DONE</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ANAVDEL</name>
					<description>Voltage Detector Control Register</description>
					<addressOffset>0x50</addressOffset>
					<size>16</size>
					<resetValue>0x001C</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>VDEL_SELECT</name>
							<description>VDEL Range Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>2.25V</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>3.0V</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4.4V</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDEL_TIM_ADJ</name>
							<description>VDEL Timing Setting</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>typ 1us - slowest response time</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>typ 500n</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>typ 250n</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>no delay - fastest response time.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDEL_EN</name>
							<description>VDEL unit Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDEL is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDEL is active</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ANAOFFSET</name>
					<description>DCO1 Offset Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>16</size>
					<resetValue>0x0040</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>ADJL_OFFSET</name>
							<description>ADJL Offset register</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>- 3.xx%, typ.</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DCO1 ADJL value is reduced by 1 step (DCO_ADJL - 1).</description>
									<value>0x3F</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>0, DCO_ADJL is not changed, default</description>
									<value>0x40</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>DCO1 ADJL value is increased by 1 step (DCO_ADJL + 1)</description>
									<value>0x41</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>+ 3.xx%, typ.</description>
									<value>0x7F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ANAOSCLPCTRL</name>
					<description>OSC_LP Control Register</description>
					<addressOffset>0x8C</addressOffset>
					<size>16</size>
					<resetValue>0x0003</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>OSC_LP Oscillator Mode</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Oscillator is enabled and in operation mode (OSC mode)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Oscillator is enabled, shaper is bypassed</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Oscillator is in power down mode</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Oscillator is in power down mode , Pad can be used in GPIO mode</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ANAOSCHPCTRL</name>
					<description>OSC_HP Control Register</description>
					<addressOffset>0x90</addressOffset>
					<size>16</size>
					<resetValue>0x0038</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>SHBY</name>
							<description>Shaper Bypass Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The shaper is not bypassed</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The shaper is bypassed</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GAINSEL</name>
							<description>OSC_HP Oscillator Gain Selection</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Gain control is configured for frequencies from 4 MHz to y1 MHz</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Gain control is configured for frequencies from 4 MHz to y2 MHz</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Gain control is configured for frequencies from 4 MHz to 20 MHz</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>OSC_HP Oscillator Mode</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Oscillator is enabled and in active power mode with shaper enabled (OSC mode)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Oscillator in power down mode with shaper enabled (External Clock Input Mode).</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Oscillator is enabled with shaper disabled. No clock output is available unless the shaper is bypass (SHBY=1)</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Oscillator is in power down mode with shaper disabled. Pad can be used in GPIO mode.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HYSCTRL</name>
							<description>Shaper Hystersis Mode</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>External clock frequency &lt; 20MHz.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>External clock frequency &gt; 20MHz</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ANASYNC1</name>
					<description>DCO1 Sync Control Register 1</description>
					<addressOffset>0x78</addressOffset>
					<size>16</size>
					<resetValue>0x0B72</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>SYNC_PRELOAD</name>
							<description>Counter target value, which defines the update cycle</description>
							<lsb>0</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Longest integration time = best accuracy</description>
									<value>0x1FFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNC_DCO_EN</name>
							<description>DCO1 synchronization feature enable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No DCO1 synchronization via an external clock source. This option is used for the DCO1 calibration using the temperature sensor.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DCO1 gets synchronized via an external clock source.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XTAL_SEL</name>
							<description>Oscillator Source select</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>OSC_LP is selected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>OSC_HP is selected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ANASYNC2</name>
					<description>DCO1 Sync Control Register 2</description>
					<addressOffset>0x7C</addressOffset>
					<size>16</size>
					<resetValue>0x0002</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>PRESCALER</name>
							<description>Prescaler value</description>
							<lsb>0</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Bypass: Internal sync counter frequency = crystal frequency</description>
									<value>0x000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DIV1: Internal sync counter feed freq. = crystal frequency/1</description>
									<value>0x001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>DIV2: Internal sync counter feed freq. = crystal frequency/2</description>
									<value>0x002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Maximum divider value (for best accuracy, but slowest response)</description>
									<value>0x7FF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNC_READY</name>
							<description>DCO1 frequency reached its target value</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Actual DCO1 frequency is out of targe</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>DCO1 is synchronized to the XTAL frequency</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
