alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
			</registers>
		</peripheral>
		<peripheral derivedFrom="VADC_G0">
			<name>VADC_G1</name>
			<description>Analog to Digital Converter</description>
			<groupName>VADC</groupName>
			<baseAddress>0x48030800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>IRQ19</name>
				<description>Analog to Digital Converter Group 1</description>
				<value>19</value>
			</interrupt>
			<interrupt>
				<name>IRQ20</name>
				<description>Analog to Digital Converter Group 1</description>
				<value>20</value>
			</interrupt>
		</peripheral>
		<peripheral>
			<name>SHS0</name>
			<description>Sample and Hold ADC Sequencer</description>
			<headerStructName>SHS</headerStructName>
			<baseAddress>0x48034000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0200</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x0008</addressOffset>
					<size>32</size>
					<resetValue>0x0099C000</resetValue>
					<resetMask>0xFFFFFF00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHSCFG</name>
					<description>SHS Configuration Register</description>
					<addressOffset>0x0040</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DIVS</name>
							<description>Divider Factor for the SHS Clock</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fSH = fCONV / 1</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fSH = fCONV / 2</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fSH = fCONV / 8</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AREF</name>
							<description>Analog Calbration Reference Voltage Selection</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>External reference, upper supply range</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Internal reference, upper supply range</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Internal reference, lower supply range</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ANOFF</name>
							<description>Analog Converter Power Down Force</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Converter controlled by bitfields ANONS (digital control block)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Converter is permanently off</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ANRDY</name>
							<description>Analog Converter Ready</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Converter is in power-down mode</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Converter is operable</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SCWC</name>
							<description>Write Control for SHS Configuration</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No write access to SHS configuration</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Bitfields ANOFF, AREF, DIVS can be written</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SP0</name>
							<description>Sample Pending on S&amp;H Unit x</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No sample pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>S&amp;H unit x has finished the sample phase</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SP1</name>
							<description>Sample Pending on S&amp;H Unit x</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No sample pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>S&amp;H unit x has finished the sample phase</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TC</name>
							<description>Test Control</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Internal test functions enabled</description>
									<value>#1011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STATE</name>
							<description>Current State of Sequencer</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Idle</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Offset calibration active</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Gain calibration active</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Startup calibration active</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Stepper process active for S&amp;H unit 0</description>
									<value>#1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Stepper process active for S&amp;H unit 1</description>
									<value>#1001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STEPCFG</name>
					<description>Stepper Configuration Register</description>
					<addressOffset>0x0044</addressOffset>
					<size>32</size>
					<resetValue>0x00000098</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>KSEL0</name>
							<description>Kernel Select</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>KSEL1</name>
							<description>Kernel Select</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>KSEL2</name>
							<description>Kernel Select</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>KSEL3</name>
							<description>Kernel Select</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>KSEL4</name>
							<description>Kernel Select</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>KSEL5</name>
							<description>Kernel Select</description>
							<lsb>20</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>KSEL6</name>
							<description>Kernel Select</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>KSEL7</name>
							<description>Kernel Select</description>
							<lsb>28</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SEN0</name>
							<description>Step x Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Off: This step is not part of the stepper sequence</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active: This step is executed during the sequence</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEN1</name>
							<description>Step x Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Off: This step is not part of the stepper sequence</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active: This step is executed during the sequence</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEN2</name>
							<description>Step x Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Off: This step is not part of the stepper sequence</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active: This step is executed during the sequence</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEN3</name>
							<description>Step x Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Off: This step is not part of the stepper sequence</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active: This step is executed during the sequence</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEN4</name>
							<description>Step x Enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Off: This step is not part of the stepper sequence</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active: This step is executed during the sequence</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEN5</name>
							<description>Step x Enable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Off: This step is not part of the stepper sequence</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active: This step is executed during the sequence</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEN6</name>
							<description>Step x Enable</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Off: This step is not part of the stepper sequence</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active: This step is executed during the sequence</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEN7</name>
							<description>Step x Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Off: This step is not part of the stepper sequence</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active: This step is executed during the sequence</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMCFG0</name>
					<description>Timing Configuration Register 0</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AT</name>
							<description>Accelerated Timing</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compatible timing: Result available after standard conversion time</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Accelerated timing: Result available as soon as converted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCRT</name>
							<description>Fast Compare Mode Response Time</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Result after tADCI x 2</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Result after tADCI x 32</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SST</name>
							<description>Short Sample Time</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compatible timing: Sample time is defined by DIVA and STC.</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Sample time is tADC x 1</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Sample time is tADC x 63</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGEN</name>
							<description>Timing Generator</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMCFG1</name>
					<description>Timing Configuration Register 1</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AT</name>
							<description>Accelerated Timing</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compatible timing: Result available after standard conversion time</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Accelerated timing: Result available as soon as converted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FCRT</name>
							<description>Fast Compare Mode Response Time</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Result after tADCI x 2</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Result after tADCI x 32</description>
									<value>0xF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SST</name>
							<description>Short Sample Time</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compatible timing: Sample time is defined by DIVA and STC.</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Sample time is tADC x 1</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Sample time is tADC x 63</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TGEN</name>
							<description>Timing Generator</description>
							<lsb>16</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CALCTR</name>
					<description>Calibration Control Register</description>
					<addressOffset>0x00BC</addressOffset>
					<size>32</size>
					<resetValue>0x03100400</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CALORD</name>
							<description>Calibration Order</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Do conversions then calibration</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Do calibration then conversions</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CALGNSTC</name>
							<description>Gain Calibration Sample Time Control</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUCALVAL</name>
							<description>Startup Calibration Cycles</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CALMAX</name>
							<description>Calibration Maximum Timing</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUCAL</name>
							<description>Start-Up Calibration</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Initiate the start-up calibration phase (indication in bitfield SHSCFG.STATE)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
