alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
				<register>
					<name>IOCR8</name>
					<description>Port 0 Input/Output Control Register 8</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PC8</name>
							<description>Port Control for Port n Pin 8 to 11</description>
							<lsb>2</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC9</name>
							<description>Port Control for Port n Pin 8 to 11</description>
							<lsb>10</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC10</name>
							<description>Port Control for Port n Pin 8 to 11</description>
							<lsb>18</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC11</name>
							<description>Port Control for Port n Pin 8 to 11</description>
							<lsb>26</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
