alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
				<register>
					<name>IOCR8</name>
					<description>Port 1 Input/Output Control Register 8</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PC8</name>
							<description>Port Control for Port n Pin 8</description>
							<lsb>2</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PHCR0</name>
					<description>Port 1 Pad Hysteresis Control Register 0</description>
					<addressOffset>0x0040</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PH0</name>
							<description>Pad Hysteresis for P1.0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH1</name>
							<description>Pad Hysteresis for P1.1</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH2</name>
							<description>Pad Hysteresis for P1.2</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH3</name>
							<description>Pad Hysteresis for P1.3</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH4</name>
							<description>Pad Hysteresis for P1.4</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH5</name>
							<description>Pad Hysteresis for P1.5</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH6</name>
							<description>Pad Hysteresis for P1.6</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH7</name>
							<description>Pad Hysteresis for P1.7</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PHCR1</name>
					<description>Port 1 Pad Hysteresis Control Register 1</description>
					<addressOffset>0x0044</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PH8</name>
							<description>Pad Hysteresis for P1.8</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PDISC</name>
					<description>Port 1 Pin Function Decision Control Register</description>
					<addressOffset>0x0060</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFF000</resetMask>
					<fields>
						<field>
							<name>PDIS0</name>
							<description>Pad Disable for Port 1 Pin 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS1</name>
							<description>Pad Disable for Port 1 Pin 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS2</name>
							<description>Pad Disable for Port 1 Pin 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS3</name>
							<description>Pad Disable for Port 1 Pin 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS4</name>
							<description>Pad Disable for Port 1 Pin 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS5</name>
							<description>Pad Disable for Port 1 Pin 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS6</name>
							<description>Pad Disable for Port 1 Pin 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS7</name>
							<description>Pad Disable for Port 1 Pin 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDIS8</name>
							<description>Pad Disable for Port 1 Pin 8</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pad P1.x is enabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pad P1.x is disabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IN</name>
					<description>Port 1 Input Register</description>
					<addressOffset>0x0024</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFF000</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Port 1 Input Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1</name>
							<description>Port 1 Input Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2</name>
							<description>Port 1 Input Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Port 1 Input Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Port 1 Input Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P5</name>
							<description>Port 1 Input Bit 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P6</name>
							<description>Port 1 Input Bit 6</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P7</name>
							<description>Port 1 Input Bit 7</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P8</name>
							<description>Port 1 Input Bit 8</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input level of P1.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input level of P1.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
