alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
				<register>
					<name>IOCR12</name>
					<description>Port 2 Input/Output Control Register 12</description>
					<addressOffset>0x001C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PC12</name>
							<description>Port Control for Port 2 Pin 12 to 13</description>
							<lsb>2</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC13</name>
							<description>Port Control for Port 2 Pin 12 to 13</description>
							<lsb>10</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PHCR0</name>
					<description>Port 2 Pad Hysteresis Control Register 0</description>
					<addressOffset>0x0040</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PH0</name>
							<description>Pad Hysteresis for Pn.0</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH1</name>
							<description>Pad Hysteresis for Pn.1</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH2</name>
							<description>Pad Hysteresis for Pn.2</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH3</name>
							<description>Pad Hysteresis for Pn.3</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH4</name>
							<description>Pad Hysteresis for Pn.4</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH5</name>
							<description>Pad Hysteresis for Pn.5</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH6</name>
							<description>Pad Hysteresis for Pn.6</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH7</name>
							<description>Pad Hysteresis for Pn.7</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PHCR1</name>
					<description>Port 2 Pad Hysteresis Control Register 1</description>
					<addressOffset>0x0044</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PH8</name>
							<description>Pad Hysteresis for P2.8</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH9</name>
							<description>Pad Hysteresis for P2.9</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH10</name>
							<description>Pad Hysteresis for P2.10</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH11</name>
							<description>Pad Hysteresis for P2.11</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH12</name>
							<description>Pad Hysteresis for P2.12</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PH13</name>
							<description>Pad Hysteresis for P2.13</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
