alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1400.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PORT3</name>
			<description>Port 3</description>
			<groupName>PORTS</groupName>
			<baseAddress>0x40040300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OUT</name>
					<description>Port 3 Output Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Port 3 Output Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The output level of P3.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The output level of P3.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1</name>
							<description>Port 3 Output Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The output level of P3.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The output level of P3.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2</name>
							<description>Port 3 Output Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The output level of P3.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The output level of P3.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Port 3 Output Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The output level of P3.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The output level of P3.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Port 3 Output Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The output level of P3.x is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The output level of P3.x is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>OMR</name>
					<description>Port 3 Output Modification Register</description>
					<addressOffset>0x0004</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>Port 3 Set Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>Port 3 Set Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS2</name>
							<description>Port 3 Set Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS3</name>
							<description>Port 3 Set Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PS4</name>
							<description>Port 3 Set Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PR0</name>
							<description>Port 3 Reset Bit 0</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PR1</name>
							<description>Port 3 Reset Bit 1</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PR2</name>
							<description>Port 3 Reset Bit 2</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PR3</name>
							<description>Port 3 Reset Bit 3</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>PR4</name>
							<description>Port 3 Reset Bit 4</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCR0</name>
					<description>Port 3 Input/Output Control Register 0</description>
					<addressOffset>0x0010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PC0</name>
							<description>Port Control for Port n Pin 0 to 3</description>
							<lsb>2</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC1</name>
							<description>Port Control for Port n Pin 0 to 3</description>
							<lsb>10</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC2</name>
							<description>Port Control for Port n Pin 0 to 3</description>
							<lsb>18</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
									<value>#000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Input - No internal pull device, Pn_OUTx = input value</description>
									<value>#000011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Input inverted - No internal pull device active</description>
									<value>#000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Input inverted - Internal pull-down device active</description>
									<value>#000101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Input inverted - Internal pull-up device active</description>
									<value>#000110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Input inverted - No internal pull device, Pn_OUTx = input value</description>
									<value>#000111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Output Push-Pull - General-purpose output</description>
									<value>#100000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>Output Push-Pull - Alternate output function 1</description>
									<value>#100001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>Output Push-Pull - Alternate output function 2</description>
									<value>#100010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>Output Push-Pull - Alternate output function 3</description>
									<value>#100011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>Output Push-Pull - Alternate output function 4</description>
									<value>#100100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>Output Push-Pull - Alternate output function 5</description>
									<value>#100101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>Output Push-Pull - Alternate output function 6</description>
									<value>#100110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>Output Push-Pull - Alternate output function 7</description>
									<value>#100111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value17</name>
									<description>Output Push-Pull - Alternate output function 8</description>
									<value>#101000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value18</name>
									<description>Output Push-Pull - Alternate output function 9</description>
									<value>#101001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value19</name>
									<description>Output Open Drain - General-purpose output</description>
									<value>#110000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value20</name>
									<description>Output Open Drain - Alternate output function 1</description>
									<value>#110001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value21</name>
									<description>Output Open Drain - Alternate output function 2</description>
									<value>#110010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value22</name>
									<description>Output Open Drain - Alternate output function 3</description>
									<value>#110011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value23</name>
									<description>Output Open Drain - Alternate output function 4</description>
									<value>#110100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value24</name>
									<description>Output Open Drain - Alternate output function 5</description>
									<value>#110101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value25</name>
									<description>Output Open Drain - Alternate output function 6</description>
									<value>#110110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value26</name>
									<description>Output Open Drain - Alternate output function 7</description>
									<value>#110111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value27</name>
									<description>Output Open Drain - Alternate output function 8</description>
									<value>#111000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value28</name>
									<description>Output Open Drain - Alternate output function 9</description>
									<value>#111001</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PC3</name>
							<description>Port Control for Port n Pin 0 to 3</description>
							<lsb>26</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input - No internal pull device active</description>
									<value>#000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input - Internal pull-down device active</description>
									<value>#000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Input - Internal pull-up device active</description>
